In [1]:
import pandas as pd

In [2]:
file = pd.read_csv('salarios.csv')

In [3]:
data = pd.DataFrame(file)

In [4]:
data.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$88968.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$80778.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$80778.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$84780.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$104736.00

In [5]:
data = data.drop(index=32181)

In [6]:
salarys = data['Employee Annual Salary'].values

convert = vars
sals = []
for v in salarys:
    convert = str(v)
    convert = convert.replace('$', '')
    sals.append(convert)

salarys_converted = []
for i in sals:
    salarys_converted.append(float(i))

In [7]:
new_salarys = pd.DataFrame(salarys_converted)
data['Employee Annual Salary'] = new_salarys

## 5 Maiores salários

In [11]:
ranking_salary = data.sort_values(by='Employee Annual Salary', ascending=False)

# Data Munging
ranking_salary['Employee Annual Salary'] = ranking_salary['Employee Annual Salary'].map('${:,.2f}'.format)

ranking_salary.head(5)

,Name,Position Title,Department,Employee Annual Salary
18039,"MC CARTHY, GARRY F",SUPERINTENDENT OF POLICE,POLICE,"$260,004.00"
7980,"EMANUEL, RAHM",MAYOR,MAYOR'S OFFICE,"$216,210.00"
25622,"SANTIAGO, JOSE A",FIRE COMMISSIONER,FIRE,"$202,728.00"
31711,"WYSINGER, ALFONZA",FIRST DEPUTY SUPERINTENDENT,POLICE,"$197,736.00"
27669,"STEWART III, CHARLES",FIRST DEPUTY FIRE COMMISSIONER,FIRE,"$197,736.00"

## Média de salário por departamento

In [17]:
ranking_salary_per_department = data.groupby(['Department']).mean()['Employee Annual Salary'].rename('Mean of Salary')

# Dataframe para os resultados
ranking_salary_per_department = pd.DataFrame(ranking_salary_per_department)
ranking_salary_per_department = ranking_salary_per_department.sort_values(by='Mean of Salary', ascending=False)

# Data Munging
ranking_salary_per_department['Mean of Salary'] = ranking_salary_per_department['Mean of Salary'].map('${:,.2f}'.format)

# Result
ranking_salary_per_department.head(5)

                Mean of Salary
Department
DoIT                $95,626.98
FIRE                $93,942.90
BUILDINGS           $93,879.46
HUMAN RELATIONS     $89,020.94
IPRA                $88,650.65

## Média de salário por título de posição

In [22]:
ranking_salary_per_positionTitle = data.groupby(['Position Title']).mean()['Employee Annual Salary'].rename('Mean of Salary')
ranking_salary_per_positionTitle = pd.DataFrame(ranking_salary_per_positionTitle)
ranking_salary_per_positionTitle = ranking_salary_per_positionTitle.sort_values(by='Mean of Salary', ascending=False)

# Data Munging
ranking_salary_per_positionTitle['Mean of Salary'] = ranking_salary_per_positionTitle['Mean of Salary'].map('${:,.2f}'.format)

# Result
ranking_salary_per_positionTitle.head(5)

                               Mean of Salary
Position Title
SUPERINTENDENT OF POLICE          $260,004.00
MAYOR                             $216,210.00
FIRE COMMISSIONER                 $202,728.00
FIRST DEPUTY FIRE COMMISSIONER    $197,736.00
FIRST DEPUTY SUPERINTENDENT       $197,736.00

In [25]:
data['Position Title'].unique()

array(['WATER RATE TAKER', 'POLICE OFFICER', 'CHIEF CONTRACT EXPEDITER',
       ..., 'FIRST DEPUTY SUPERINTENDENT', 'PREPRESS TECHNICIAN',
       'MECHANICAL ENGINEER IV'], dtype=object)